
office:~/projects/nacs-lab/yyc-data/calculations/single-atom
yuyichao% julia -p 8 -L test/heating-tests/two-level-1d.jl -f test/heating-tests/param-plot.jl
WARNING: replacing module StructsOfArrays
WARNING: replacing module StructsOfArrays
WARNING: replacing module StructsOfArrays
WARNING: replacing module StructsOfArrays
WARNING: replacing module StructsOfArrays
WARNING: replacing module StructsOfArrays
WARNING: replacing module StructsOfArrays
WARNING: replacing module StructsOfArrays
WARNING: replacing module Compat
WARNING: replacing module Compat
WARNING: replacing module Compat
WARNING: replacing module Compat
WARNING: replacing module Compat
WARNING: replacing module Compat
WARNING: replacing module Compat
WARNING: replacing module Compat
start
        From worker 8:  Running β=2.5, δ=-40.0, t=8000.0
        From worker 7:  Running β=2.5, δ=-45.0, t=8000.0
        From worker 3:  Running β=2.5, δ=-30.0, t=8000.0
        From worker 6:  Running β=2.5, δ=-50.0, t=8000.0
        From worker 5:  Running β=2.5, δ=-35.0, t=8000.0
        From worker 2:  Running β=2.5, δ=-55.0, t=8000.0
        From worker 9:  Running β=2.5, δ=-25.0, t=8000.0
        From worker 4:  Running β=2.5, δ=-20.0, t=8000.0
        From worker 5:  Running β=1.0, δ=-5.0, t=8000.0
        From worker 8:  Running β=1.0, δ=-3.75, t=8000.0
        From worker 7:  Running β=1.0, δ=-2.5, t=8000.0
        From worker 6:  Running β=1.0, δ=-2.1875, t=8000.0
        From worker 3:  Running β=1.0, δ=-1.875, t=8000.0
        From worker 9:  Running β=1.0, δ=-1.5625, t=8000.0
        From worker 2:  Running β=1.0, δ=-1.25, t=8000.0
        From worker 4:  Running β=1.0, δ=0.0, t=8000.0
        From worker 5:  Running β=2.5, δ=-55.0, t=3000.0
        From worker 3:  Running β=2.5, δ=-50.0, t=3000.0
        From worker 8:  Running β=2.5, δ=-45.0, t=3000.0
        From worker 7:  Running β=2.5, δ=-40.0, t=3000.0
        From worker 6:  Running β=2.5, δ=-35.0, t=3000.0
        From worker 4:  Running β=2.5, δ=-30.0, t=3000.0
        From worker 9:  Running β=2.5, δ=-25.0, t=3000.0
        From worker 2:  Running β=2.5, δ=-20.0, t=3000.0
        From worker 5:  Running β=1.0, δ=-5.0, t=3000.0
        From worker 8:  Running β=1.0, δ=-3.75, t=3000.0
        From worker 3:  Running β=1.0, δ=-2.5, t=3000.0
        From worker 7:  Running β=1.0, δ=-2.1875, t=3000.0
        From worker 6:  Running β=1.0, δ=-1.875, t=3000.0
        From worker 4:  Running β=1.0, δ=-1.5625, t=3000.0
        From worker 2:  Running β=1.0, δ=-1.25, t=3000.0
        From worker 9:  Running β=1.0, δ=0.0, t=3000.0
12377.923930 seconds (2.43 M allocations: 2.110 GB, 0.00% gc time)
WARNING: No working GUI backend found for matplotlib.
WARNING: No working GUI backend found for matplotlib.
WARNING: No working GUI backend found for matplotlib.
WARNING: No working GUI backend found for matplotlib.
WARNING: No working GUI backend found for matplotlib.
WARNING: No working GUI backend found for matplotlib.
WARNING: No working GUI backend found for matplotlib.
WARNING: No working GUI backend found for matplotlib.
WARNING: No working GUI backend found for matplotlib.
("final_energy",[(2.5f0,-55.0f0,8000.0f0),(2.5f0,-50.0f0,8000.0f0),(2.5f0,-45.0f0,8000.0f0),(2.5f0,-40.0f0,8000.0f0),(2.5f0,-35.0f0,8000.0f0),(2.5f0,-30.0f0,8000.0f0),
(2.5f0,-25.0f0,8000.0f0),(2.5f0,-20.0f0,8000.0f0),(1.0f0,-5.0f0,8000.0f0),(1.0f0,-3.75f0,8000.0f0),(1.0f0,-2.5f0,8000.0f0),(1.0f0,-2.1875f0,8000.0f0),(1.0f0,-1.875f0,8
000.0f0),(1.0f0,-1.5625f0,8000.0f0),(1.0f0,-1.25f0,8000.0f0),(1.0f0,0.0f0,8000.0f0),(2.5f0,-55.0f0,3000.0f0),(2.5f0,-50.0f0,3000.0f0),(2.5f0,-45.0f0,3000.0f0),(2.5f0,-
40.0f0,3000.0f0),(2.5f0,-35.0f0,3000.0f0),(2.5f0,-30.0f0,3000.0f0),(2.5f0,-25.0f0,3000.0f0),(2.5f0,-20.0f0,3000.0f0),(1.0f0,-5.0f0,3000.0f0),(1.0f0,-3.75f0,3000.0f0),(
1.0f0,-2.5f0,3000.0f0),(1.0f0,-2.1875f0,3000.0f0),(1.0f0,-1.875f0,3000.0f0),(1.0f0,-1.5625f0,3000.0f0),(1.0f0,-1.25f0,3000.0f0),(1.0f0,0.0f0,3000.0f0)],Float32[63.4561
8,45.29039,23.32126,14.66632,34.994743,125.579254,205.54025,215.45457,21.167898,12.642207,17.190683,23.655512,18.421507,21.9364,25.455645,253.96547,63.028934,73.790184
,46.753464,13.465214,24.07711,127.39077,194.883,231.00371,17.464119,19.157333,14.443634,24.277111,16.481863,20.649187,28.3876,254.08058],Float32[8.557624,6.800854,3.31
2992,1.8861809,3.9881048,11.119629,13.721706,14.878317,3.5093844,1.3894494,2.1956837,2.8893924,2.5558279,2.8027475,3.0489688,23.442814,8.12273,7.719166,5.329584,1.4981
498,3.4356673,10.287797,14.3586445,14.689869,2.4865623,2.9211593,2.1553912,2.6118898,1.8177427,2.5111563,2.9018338,24.064474])
("escape_time",[(2.5f0,-55.0f0,8000.0f0),(2.5f0,-50.0f0,8000.0f0),(2.5f0,-45.0f0,8000.0f0),(2.5f0,-40.0f0,8000.0f0),(2.5f0,-35.0f0,8000.0f0),(2.5f0,-30.0f0,8000.0f0),(
2.5f0,-25.0f0,8000.0f0),(2.5f0,-20.0f0,8000.0f0),(1.0f0,-5.0f0,8000.0f0),(1.0f0,-3.75f0,8000.0f0),(1.0f0,-2.5f0,8000.0f0),(1.0f0,-2.1875f0,8000.0f0),(1.0f0,-1.875f0,80
00.0f0),(1.0f0,-1.5625f0,8000.0f0),(1.0f0,-1.25f0,8000.0f0),(1.0f0,0.0f0,8000.0f0),(2.5f0,-55.0f0,3000.0f0),(2.5f0,-50.0f0,3000.0f0),(2.5f0,-45.0f0,3000.0f0),(2.5f0,-4
0.0f0,3000.0f0),(2.5f0,-35.0f0,3000.0f0),(2.5f0,-30.0f0,3000.0f0),(2.5f0,-25.0f0,3000.0f0),(2.5f0,-20.0f0,3000.0f0),(1.0f0,-5.0f0,3000.0f0),(1.0f0,-3.75f0,3000.0f0),(1
.0f0,-2.5f0,3000.0f0),(1.0f0,-2.1875f0,3000.0f0),(1.0f0,-1.875f0,3000.0f0),(1.0f0,-1.5625f0,3000.0f0),(1.0f0,-1.25f0,3000.0f0),(1.0f0,0.0f0,3000.0f0)],Float32[6394.316
4,5308.825,6577.1235,6245.32,5237.38,333.30368,441.44122,802.9839,6717.811,6564.2373,6386.787,6545.2393,6438.6963,5470.143,5518.2095,546.3686,2572.2244,2366.96,2124.98
63,2478.0193,1849.5073,376.38263,450.48016,668.72736,2226.3938,2283.356,2286.4487,2281.07,2317.4495,2276.5046,2112.4912,531.5531],Float32[445.07416,525.10645,431.81754
,471.99774,480.23956,67.41136,120.77287,232.97807,417.50003,437.78467,451.38898,423.22485,431.43216,505.68906,462.93542,108.63853,146.23628,169.60109,187.50897,159.666
52,192.27663,54.116,91.589096,135.90025,186.47055,181.65637,181.44844,182.76414,176.82498,176.30423,179.23807,92.31352])
("photon_count",[(2.5f0,-55.0f0,8000.0f0),(2.5f0,-50.0f0,8000.0f0),(2.5f0,-45.0f0,8000.0f0),(2.5f0,-40.0f0,8000.0f0),(2.5f0,-35.0f0,8000.0f0),(2.5f0,-30.0f0,8000.0f0),
(2.5f0,-25.0f0,8000.0f0),(2.5f0,-20.0f0,8000.0f0),(1.0f0,-5.0f0,8000.0f0),(1.0f0,-3.75f0,8000.0f0),(1.0f0,-2.5f0,8000.0f0),(1.0f0,-2.1875f0,8000.0f0),(1.0f0,-1.875f0,8
000.0f0),(1.0f0,-1.5625f0,8000.0f0),(1.0f0,-1.25f0,8000.0f0),(1.0f0,0.0f0,8000.0f0),(2.5f0,-55.0f0,3000.0f0),(2.5f0,-50.0f0,3000.0f0),(2.5f0,-45.0f0,3000.0f0),(2.5f0,-
40.0f0,3000.0f0),(2.5f0,-35.0f0,3000.0f0),(2.5f0,-30.0f0,3000.0f0),(2.5f0,-25.0f0,3000.0f0),(2.5f0,-20.0f0,3000.0f0),(1.0f0,-5.0f0,3000.0f0),(1.0f0,-3.75f0,3000.0f0),(
1.0f0,-2.5f0,3000.0f0),(1.0f0,-2.1875f0,3000.0f0),(1.0f0,-1.875f0,3000.0f0),(1.0f0,-1.5625f0,3000.0f0),(1.0f0,-1.25f0,3000.0f0),(1.0f0,0.0f0,3000.0f0)],Float32[775.52,
1051.2,3209.58,10681.72,20982.22,804.9,493.3,420.78,11989.48,15914.7,22182.0,24967.18,26371.48,24130.94,25969.36,3075.26,317.32,431.54,883.86,4436.98,7091.76,878.78,53
3.04,408.8,3745.52,5520.32,7960.84,8484.7,9261.88,9954.4,10065.16,2907.42],Float32[67.42193,111.23708,260.0938,929.6869,2079.5957,184.81075,101.677704,79.5127,803.2597
,1133.5554,1623.9938,1669.8168,1835.1261,2289.0872,2191.045,627.01855,23.763245,38.151356,98.54551,355.6456,844.2965,135.03445,86.27528,58.629417,333.98358,472.98337,6
69.3141,716.4272,747.7047,803.2105,885.5868,526.742])
office:~/projects/nacs-lab/yyc-data/calculations/single-atom
yuyichao%
